zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00100.atdf
        <module name="BROMC" id="04402" name2="prm_boot_ahb_v2" version="2a0">
          <instance name="BROMC">
            <register-group name="BROMC" name-in-module="BROMC" address-space="base" offset="0x44804000"/>
            <parameters>
              <param name="BROMC_PADDR_MSB" value="12" caption="--"/>
              <param name="BROMC_PDATA_MSB" value="31" caption="--"/>
              <param name="BROMC_PSTRB_MSB" value="3" caption="--"/>
              <param name="BROMC_PPROT_MSB" value="5" caption="--"/>
              <param name="BROMC_ROM_ADDR_MSB" value="13" caption="--"/>
              <param name="BROMC_ROM_DATA_MSB" value="31" caption="--"/>
              <param name="BROMC_ROM_DATA_SIZE" value="16384" caption="--"/>
              <param name="BROMC_ROM_PRMWS_DEFAULT" value="0" caption="--"/>
              <param name="BROMC_ROM_KEN" value="0" caption="--"/>
              <param name="BROMC_ROM_CRC_EN" value="1" caption="--"/>
              <param name="BROMC_ROM_SPLIT" value="0x3400" caption="(8K for PK code)  (Note: This parameter may change once boot and PK code sizes are known)"/>
              <param name="BROMC_BOOTCRC_MODE" value="2" caption="--"/>
              <param name="BROMC_FUSES_DATA_MSB" value="127" caption="See Flash Control Chapter for Values"/>
              <param name="BROMC_FUSES_RDY_MSB" value="14" caption="See Flash Control Chapter for Values"/>
              <param name="BROMC_FUSES_UCFG_ROWID" value="14" caption="See Chapter 5 CCFG Fuse map for Values"/>
              <param name="BROMC_FUSES_UCFG_START" value="0" caption="See Chapter 5 CCFG Fuse map for Values"/>
              <param name="BROMC_CTRLAPRIV_IMPLEMENTED" value="1" caption="--"/>
              <param name="BROMC_WPCTRL_IMPLEMENTED" value="0" caption="--"/>
              <param name="BROMC_WPCTRL_KEY" value="0x42524F" caption="--"/>
              <param name="BROMC_NUM_COOLDN_CYCLES" value="2" caption="--"/>
              <param name="BROMC_NUM_WARMUP_CYCLES" value="2" caption="--"/>
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="2" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="23" caption="Instance index for BROMC"/>
              <param name="MCLK_ID_AHB" value="32" caption="Index for BROMC AHB clock"/>
              <param name="MCLK_ID_APB" value="33" caption="Index for BROMC APB clock"/>
              <param name="PAC_ID" value="23" caption="Index for BROMC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="CAN" id="05010" name2="can_fd_apb_v1" version="1a0">
          <instance name="CAN0">
            <register-group name="CAN0" name-in-module="CAN" address-space="base" offset="0x4402E000"/>
            <signals>
              <signal group="RX" function="H" pad="PA10" ioset="3"/>
              <signal group="RX" function="H" pad="PC01" ioset="1"/>
              <signal group="RX" function="H" pad="PD06" ioset="2"/>
              <signal group="TX" function="H" pad="PA11" ioset="3"/>
              <signal group="TX" function="H" pad="PC02" ioset="1"/>
              <signal group="TX" function="H" pad="PD08" ioset="2"/>
            </signals>
            <parameters>
              <param name="ECC_ERR_IMPLEMENTED" value="0" caption="ECC error implemented?"/>
              <param name="INTERNAL_TB_SOF" value="3" caption="0: No SOF and no internal Time base, 1: SOF and no internal Time"/>
              <param name="MSG_RAM_ADDR" value="0x20" caption="8-bits MSB"/>
              <param name="NUMBER_TS" value="1" caption="0: 4 Timestamp reg, 1: 8 timestamp reg, 2: 16 timestamp reg"/>
              <param name="PRIV_IMPLEMENTED" value="1" caption="Privilege access is implemented? 0: CTRLA.PRIV bit not implemented, 1: CTRLA.PRIV bit implemented"/>
              <param name="RXD_SYNC_METHOD" value="0" caption="RXD Synchronization Method"/>
              <param name="SYNT_TIMESTAMP" value="0x00000" caption="CAN_SYNT_TIMESTAMP[19:16]: CREL.YEAR reset value (BCD-coded),CAN_SYNT_TIMESTAMP[15:8]: CREL.MON reset value (BCD-coded), CAN_SYNT_TIMESTAMP[7:0]: CREL.DAY reset value (BCD-coded)"/>
              <param name="WPCTRL_IMPLEMENTED" value="0" caption="Write protection control register implemented?"/>
              <param name="WPCTRL_KEY" value="0x43414E" caption="Write protection 24 bit key"/>
              <param name="GCLK_ID" value="6"/>
              <param name="BRIDGE_ID" value="0" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="23" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="17" caption="Instance index for CAN0"/>
              <param name="MCLK_ID_AHB" value="23" caption="Index for CAN0 AHB clock"/>
              <param name="PAC_ID" value="17" caption="Index for CAN0 registers write protection"/>
            </parameters>
          </instance>
          <instance name="CAN1">
            <register-group name="CAN1" name-in-module="CAN" address-space="base" offset="0x44030000"/>
            <signals>
              <signal group="RX" function="H" pad="PA00" ioset="2"/>
              <signal group="RX" function="H" pad="PC05" ioset="1"/>
              <signal group="RX" function="H" pad="PD12" ioset="3"/>
              <signal group="TX" function="H" pad="PA01" ioset="2"/>
              <signal group="TX" function="H" pad="PC06" ioset="1"/>
              <signal group="TX" function="H" pad="PD13" ioset="3"/>
            </signals>
            <parameters>
              <param name="ECC_ERR_IMPLEMENTED" value="0" caption="ECC error implemented?"/>
              <param name="INTERNAL_TB_SOF" value="3" caption="0: No SOF and no internal Time base, 1: SOF and no internal Time"/>
              <param name="MSG_RAM_ADDR" value="0x20" caption="8-bits MSB"/>
              <param name="NUMBER_TS" value="1" caption="0: 4 Timestamp reg, 1: 8 timestamp reg, 2: 16 timestamp reg"/>
              <param name="PRIV_IMPLEMENTED" value="1" caption="Privilege access is implemented? 0: CTRLA.PRIV bit not implemented, 1: CTRLA.PRIV bit implemented"/>
              <param name="RXD_SYNC_METHOD" value="0" caption="RXD Synchronization Method"/>
              <param name="SYNT_TIMESTAMP" value="0x00000" caption="CAN_SYNT_TIMESTAMP[19:16]: CREL.YEAR reset value (BCD-coded),CAN_SYNT_TIMESTAMP[15:8]: CREL.MON reset value (BCD-coded), CAN_SYNT_TIMESTAMP[7:0]: CREL.DAY reset value (BCD-coded)"/>
              <param name="WPCTRL_IMPLEMENTED" value="0" caption="Write protection control register implemented?"/>
              <param name="WPCTRL_KEY" value="0x43414E" caption="Write protection 24 bit key"/>
              <param name="GCLK_ID" value="7"/>
              <param name="BRIDGE_ID" value="0" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="24" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="18" caption="Instance index for CAN1"/>
              <param name="MCLK_ID_AHB" value="24" caption="Index for CAN1 AHB clock"/>
              <param name="PAC_ID" value="18" caption="Index for CAN1 registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="CCL" id="03628" name2="cla_ccl_u2225_v2" version="2b0">
          <instance name="CCL0">
            <register-group name="CCL0" name-in-module="CCL" address-space="base" offset="0x4482E000"/>
            <signals>
              <signal group="IN" index="0" function="I" pad="PC12" ioset="2"/>
              <signal group="IN" index="0" function="I" pad="PC01" ioset="1"/>
              <signal group="IN" index="1" function="I" pad="PC02" ioset="1"/>
              <signal group="IN" index="1" function="I" pad="PC14" ioset="2"/>
              <signal group="IN" index="2" function="I" pad="PC15" ioset="2"/>
              <signal group="IN" index="2" function="I" pad="PC09" ioset="1"/>
              <signal group="IN" index="3" function="I" pad="PD00" ioset="1"/>
              <signal group="IN" index="3" function="I" pad="PD18" ioset="2"/>
              <signal group="IN" index="4" function="I" pad="PD01" ioset="1"/>
              <signal group="IN" index="4" function="I" pad="PD17" ioset="2"/>
              <signal group="IN" index="5" function="I" pad="PD10" ioset="1"/>
              <signal group="IN" index="5" function="I" pad="PD19" ioset="2"/>
              <signal group="IN" index="6" function="I" pad="PA00" ioset="1"/>
              <signal group="IN" index="6" function="I" pad="PA14" ioset="2"/>
              <signal group="IN" index="7" function="I" pad="PA01" ioset="1"/>
              <signal group="IN" index="7" function="I" pad="PA15" ioset="2"/>
              <signal group="IN" index="8" function="I" pad="PA10" ioset="1"/>
              <signal group="IN" index="8" function="I" pad="PA18" ioset="2"/>
              <signal group="IN" index="9" function="I" pad="PB12" ioset="2"/>
              <signal group="IN" index="9" function="I" pad="PB05" ioset="1"/>
              <signal group="IN" index="10" function="I" pad="PB14" ioset="2"/>
              <signal group="IN" index="10" function="I" pad="PB06" ioset="1"/>
              <signal group="IN" index="11" function="I" pad="PB15" ioset="2"/>
              <signal group="IN" index="11" function="I" pad="PB10" ioset="1"/>
              <signal group="OUT" index="0" function="I" pad="PC13" ioset="2"/>
              <signal group="OUT" index="0" function="I" pad="PC03" ioset="1"/>
              <signal group="OUT" index="1" function="I" pad="PD14" ioset="2"/>
              <signal group="OUT" index="1" function="I" pad="PD08" ioset="1"/>
              <signal group="OUT" index="2" function="I" pad="PA02" ioset="1"/>
              <signal group="OUT" index="2" function="I" pad="PA19" ioset="2"/>
              <signal group="OUT" index="3" function="I" pad="PB16" ioset="2"/>
              <signal group="OUT" index="3" function="I" pad="PC00" ioset="1"/>
            </signals>
            <parameters>
              <param name="LUT_NUM" value="4" caption="Number of LUT in a CCL"/>
              <param name="GCLK_ID" value="36"/>
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="23" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="42" caption="Instance index for CCL0"/>
              <param name="MCLK_ID_APB" value="52" caption="Index for CCL0 APB clock"/>
              <param name="PAC_ID" value="42" caption="Index for CCL0 registers write protection"/>
            </parameters>
          </instance>
