zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00100.atdf
            <parameters>
              <param name="FCR_AHB_PORTS_NB" value="1" caption="--"/>
              <param name="FCR_CTRLAPRIV_IMPLEMENTED" value="1" caption="--"/>
              <param name="FCR_INTFLAGSET_IMPLEMENTED" value="1" caption="--"/>
              <param name="FCR_WPCTRL_IMPLEMENTED" value="0" caption="--"/>
              <param name="FCR_WPCTRL_KEY" value="0x464352" caption="--"/>
              <param name="FCR_PDMO_MSB" value="7" caption="--"/>
              <param name="FCR_PFM_ADDR_BASE" value="0x0C000000" caption="--"/>
              <param name="FCR_BFM_ADDR_BASE" value="0x08000000" caption="--"/>
              <param name="FCR_CFM_ADDR_BASE" value="0x0A000000" caption="--"/>
              <param name="FCR_FCD_ADDR_BASE" value="0x0B000000" caption="--"/>
              <param name="FCR_VSS_CFG0_BASE" value="0x0A004000" caption="--"/>
              <param name="FCR_VSS_CFG1_BASE" value="0x0A005000" caption="--"/>
              <param name="FCR_VSS_CFG2_BASE" value="0" caption="--"/>
              <param name="FCR_VSS_CFG3_BASE" value="0" caption="--"/>
              <param name="FCR_VSS_CFG4_BASE" value="0" caption="--"/>
              <param name="FCR_VSS_CFG5_BASE" value="0" caption="--"/>
              <param name="FCR_CRC_PRESENT" value="1" caption="--"/>
              <param name="FCR_FLT_PRESENT" value="1" caption="--"/>
              <param name="FCR_ECC_PRESENT" value="1" caption="--"/>
              <param name="FCR_PCHE_PRESENT" value="1" caption="--"/>
              <param name="FCR_PCHE_AHB_NUM" value="0" caption="--"/>
              <param name="FCR_PCHE_NUM_LINES" value="4" caption="--"/>
              <param name="FCR_PCHE_TAG_MASK" value="0xF9F8000F" caption="--"/>
              <param name="FCR_FUSES_READY_CYCLES" value="2" caption="--"/>
              <param name="FCR_FUSES_DATA_CYCLES" value="4" caption="--"/>
              <param name="FUSES_RDY_MSB" value="14" caption="--"/>
              <param name="FUSES_DATA_MSB" value="127" caption="--"/>
              <param name="FCR_HDATA_SIZE" value="32" caption="--"/>
              <param name="FCR_F1RR_ADDR" value="0x0A007000" caption="--"/>
              <param name="FCR_F2RR_ADDR" value="0" caption="Not applicable for QSilver"/>
              <param name="FCR_RR_NUM_READS" value="1" caption="--"/>
              <param name="FCR_NUM_RR_SFR" value="1" caption="--"/>
              <param name="FCR_FFF_ADDR" value="0x0A007040" caption="--"/>
              <param name="FCR_NOT_FFF_VALUE" value="0xA5A5A5A5" caption="--"/>
              <param name="FCR_OTPLOCK_ADDR" value="0x0A007060" caption="--"/>
              <param name="FCR_CAL_ADDR" value="0x0A007080" caption="--"/>
              <param name="FCR_CAL_NUM_READS" value="14" caption="--"/>
              <param name="FCR_PBUCFG_ADDR" value="0x0A003400" caption="--"/>
              <param name="FCR_PERIOD_MIN" value="75" caption="--"/>
              <param name="FCR_PERIOD_NOM" value="116" caption="--"/>
              <param name="FCR_TCALH_NS" value="10000" caption="--"/>
              <param name="PFM_NUM_PANELS" value="1" caption="--"/>
              <param name="PFM_PNL_ADDR_MSB" value="18" caption="--"/>
              <param name="PFM_SYS_ADDR_MSB" value="18" caption="--"/>
              <param name="PFM_ROW_ADDR_MSB" value="9" caption="--"/>
              <param name="PFM_PAGE_ADDR_MSB" value="11" caption="--"/>
              <param name="PFM_PNL_DATA_MSB" value="139" caption="--"/>
              <param name="PFM_DATA_MSB" value="127" caption="--"/>
              <param name="PFM_PNL_WDATA_MSB" value="34" caption="Parameter only in DOS Rev C, not in RTL"/>
              <param name="PFM_NUM_RR" value="2" caption="--"/>
              <param name="PFM_SRHT_PRESENT" value="0" caption="--"/>
              <param name="BFM_PNL_ADDR_MSB" value="13" caption="--"/>
              <param name="BFM_SYS_ADDR_MSB" value="13" caption="--"/>
              <param name="CFM_PNL_ADDR_MSB" value="14" caption="--"/>
              <param name="CFM_SYS_ADDR_MSB" value="14" caption="--"/>
              <param name="NVR_NUM_PAGES" value="12" caption="--"/>
              <param name="PFM_TDPDH_NS" value="5000" caption="--"/>
              <param name="PFM_TDPDS_NS" value="100" caption="--"/>
              <param name="PFM_TMS_NS" value="5000" caption="See Note 2"/>
              <param name="PFM_TMH_NS" value="100" caption="See Note 2"/>
              <param name="PFM_TRT_NS" value="500" caption="--"/>
              <param name="PFM_TRHR_NS" value="1000" caption="--"/>
              <param name="PFM_TONWAIT_NS" value="6000" caption="--"/>
              <param name="PFM_TLKCFG_NS" value="1000" caption="--"/>
              <param name="PFM_ACC_NS" value="25" caption="--"/>
              <param name="PFM_ACC_HT_NS" value="30" caption="--"/>
              <param name="PFM_ACC_RECALL_NS" value="70" caption="--"/>
              <param name="BRIDGE_ID" value="0" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="1" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="1" caption="Instance index for FCR"/>
              <param name="MCLK_ID_AHB" value="1" caption="Index for FCR AHB clock"/>
              <param name="PAC_ID" value="1" caption="Index for FCR registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="FCW" id="04971" name2="pfm_ctrlw_apb_v2" version="2a0">
          <instance name="FCW">
            <register-group name="FCW" name-in-module="FCW" address-space="base" offset="0x44004000"/>
            <parameters>
              <param name="FCW_CTRLAPRIV_IMPLEMENTED" value="1" caption="--"/>
              <param name="FCW_INTFLAGSET_IMPLEMENTED" value="1" caption="--"/>
              <param name="FCW_WPCTRL_IMPLEMENTED" value="0" caption="--"/>
              <param name="FCW_WPCTRL_KEY" value="0x464357" caption="--"/>
              <param name="FCW_PFM_ADDR_BASE" value="0x0C000000" caption="--"/>
              <param name="FCW_BFM_ADDR_BASE" value="0x08000000" caption="--"/>
              <param name="FCW_CFM_ADDR_BASE" value="0x0A000000" caption="--"/>
              <param name="FCW_VSS_CFG0_BASE" value="0x0A004000" caption="--"/>
              <param name="FCW_VSS_CFG1_BASE" value="0x0A005000" caption="--"/>
              <param name="FCW_VSS_CFG2_BASE" value="0" caption="Not applicable for QS"/>
              <param name="FCW_VSS_CFG3_BASE" value="0" caption="Not applicable for QS"/>
              <param name="FCW_VSS_CFG4_BASE" value="0" caption="Not applicable for QS"/>
              <param name="FCW_VSS_CFG5_BASE" value="0" caption="Not applicable for QS"/>
              <param name="FCW_PWP_REGIONS" value="4" caption="--"/>
              <param name="FCW_PWP_MSB" value="6" caption="--"/>
              <param name="FCW_TAMPER_PRESENT" value="1" caption="--"/>
              <param name="FCW_TAMPER_ADDR" value="0x0A003200" caption="--"/>
              <param name="FCW_TAMPER_DATA" value="0x00000000" caption="--"/>
              <param name="FCW_SD_USE_CPCNT" value="1" caption="--"/>
              <param name="FCW_NUM_DATA_SFR" value="4" caption="(PFM_DATA_MSB+1)/32"/>
              <param name="FCW_TPAR_MSB" value="3" caption="(PFM_PNL_DATA_MSB - PFM_DATA_MSB)/4"/>
              <param name="FCW_PERIOD_MIN" value="75" caption="--"/>
              <param name="FCW_PERIOD_NOM" value="116" caption="--"/>
              <param name="PFM_SIZE" value="6" caption="--"/>
              <param name="PFM_NUM_PANELS" value="1" caption="--"/>
              <param name="PFM_PNL_ADDR_MSB" value="18" caption="--"/>
              <param name="PFM_SYS_ADDR_MSB" value="18" caption="--"/>
              <param name="PFM_ROW_ADDR_MSB" value="9" caption="--"/>
              <param name="PFM_PAGE_ADDR_MSB" value="11" caption="--"/>
              <param name="PFM_PNL_DATA_MSB" value="139" caption="--"/>
              <param name="PFM_DATA_MSB" value="127" caption="--"/>
              <param name="PFM_NUM_RR" value="2" caption="--"/>
              <param name="BFM_PNL_ADDR_MSB" value="13" caption="--"/>
              <param name="BFM_SYS_ADDR_MSB" value="13" caption="--"/>
              <param name="CFM_PNL_ADDR_MSB" value="14" caption="--"/>
              <param name="CFM_SYS_ADDR_MSB" value="14" caption="--"/>
              <param name="NVR_NUM_PAGES" value="12" caption="--"/>
              <param name="PFM_TWS_NS" value="5" caption="value irrelevant, must be &gt;0"/>
              <param name="PFM_TWH_NS" value="5" caption="value irrelevant, must be &gt;0"/>
              <param name="PFM_TNVS_NS" value="4000" caption="See Note 2"/>
              <param name="PFM_TPROG_NS" value="18000" caption="See Note 3"/>
              <param name="PFM_TPREPROG_NS" value="3000" caption="See Note 3"/>
              <param name="PFM_TADS_NS" value="15" caption="See Note 2"/>
              <param name="PFM_TADH_NS" value="15" caption="See Note 2"/>
              <param name="PFM_TPGS_NS" value="8000" caption="See Note 2"/>
              <param name="PFM_TPREPGH_NS" value="15" caption="See Note 2"/>
              <param name="PFM_TPREPGS_NS" value="1000" caption="See Note 2"/>
              <param name="PFM_TPGH_NS" value="15" caption="See Note 2"/>
              <param name="PFM_TRCV_PROG_NS" value="5000" caption="See Note 2"/>
              <param name="PFM_TRCV_ERASE_NS" value="50000" caption="See Note 2"/>
              <param name="PFM_TERASE_NS" value="18000000" caption="See Note 3"/>
              <param name="PFM_TERASE_RETRY_NS" value="4500000" caption="See Note 3"/>
              <param name="PFM_TSCE_NS" value="18000000" caption="See Note 3"/>
              <param name="PFM_TRW_NS" value="100" caption="See Note 2"/>
              <param name="PFM_TPUMPENS" value="1000" caption="See Note 2"/>
              <param name="PFM_TPUMPENH" value="100" caption="See Note 2"/>
              <param name="PFM_TPUMP_CYCLES" value="1029" caption="See Note 2"/>
              <param name="BRIDGE_ID" value="0" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="2" caption="H2PB Peripheral ID"/>
              <param name="FLASH_SIZE" value="524288"/>
              <param name="INSTANCE_ID" value="2" caption="Instance index for FCW"/>
              <param name="MCLK_ID_AHB" value="2" caption="Index for FCW AHB clock"/>
              <param name="PAC_ID" value="2" caption="Index for FCW registers write protection"/>
            </parameters>
          </instance>
        </module>
