zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00100.atdf
        <module name="SAU" id="SYSTEM_IP" version="1.0.0">
          <instance name="SAU">
            <register-group name="SAU" name-in-module="SAU" address-space="base" offset="0xE000EDD0"/>
          </instance>
        </module>
        <module name="SCB" id="SYSTEM_IP" version="1.0.0">
          <instance name="SCB">
            <register-group name="SCB" name-in-module="SCB" address-space="base" offset="0xE000ED00"/>
          </instance>
        </module>
        <module name="SERCOM" id="03715" name2="com_sercom_u2201_v6" version="6c0">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x44808000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PB15" ioset="2"/>
              <signal group="PAD" index="0" function="D" pad="PC00" ioset="1"/>
              <signal group="PAD" index="1" function="D" pad="PB16" ioset="2"/>
              <signal group="PAD" index="1" function="D" pad="PC01" ioset="1"/>
              <signal group="PAD" index="2" function="D" pad="PB17" ioset="2"/>
              <signal group="PAD" index="2" function="D" pad="PC02" ioset="1"/>
              <signal group="PAD" index="3" function="D" pad="PC11" ioset="2"/>
              <signal group="PAD" index="3" function="D" pad="PC03" ioset="1"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?"/>
              <param name="FIFO_SIZE" value="16" caption="Rx-Tx FIFO size in bytes"/>
              <param name="FSYNC_IMPLEMENTED" value="1" caption="SPI Frame Synch mode implemented?"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="1" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?"/>
              <param name="ULTRA_IMPLEMENTATION" value="0" caption="ULTRA platform compatibility?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="GCLK_ID_SLOW" value="20"/>
              <param name="GCLK_ID_CORE" value="21"/>
              <param name="DMAC_ID_RX" value="4"/>
              <param name="DMAC_ID_TX" value="5"/>
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="4" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="26" caption="Instance index for SERCOM0"/>
              <param name="MCLK_ID_APB" value="36" caption="Index for SERCOM0 APB clock"/>
              <param name="PAC_ID" value="26" caption="Index for SERCOM0 registers write protection"/>
            </parameters>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x4480A000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PC15" ioset="3"/>
              <signal group="PAD" index="0" function="D" pad="PD01"/>
              <signal group="PAD" index="1" function="D" pad="PC14" ioset="3"/>
              <signal group="PAD" index="1" function="D" pad="PD00"/>
              <signal group="PAD" index="2" function="D" pad="PC13" ioset="3"/>
              <signal group="PAD" index="2" function="D" pad="PC06" ioset="1"/>
              <signal group="PAD" index="2" function="D" pad="PD10" ioset="2"/>
              <signal group="PAD" index="3" function="D" pad="PC12" ioset="3"/>
              <signal group="PAD" index="3" function="D" pad="PC05" ioset="1"/>
              <signal group="PAD" index="3" function="D" pad="PD11" ioset="2"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?"/>
              <param name="FIFO_SIZE" value="16" caption="Rx-Tx FIFO size in bytes"/>
              <param name="FSYNC_IMPLEMENTED" value="1" caption="SPI Frame Synch mode implemented?"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="1" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?"/>
              <param name="ULTRA_IMPLEMENTATION" value="0" caption="ULTRA platform compatibility?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="GCLK_ID_SLOW" value="20"/>
              <param name="GCLK_ID_CORE" value="22"/>
              <param name="DMAC_ID_RX" value="6"/>
              <param name="DMAC_ID_TX" value="7"/>
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="5" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="27" caption="Instance index for SERCOM1"/>
              <param name="MCLK_ID_APB" value="37" caption="Index for SERCOM1 APB clock"/>
              <param name="PAC_ID" value="27" caption="Index for SERCOM1 registers write protection"/>
            </parameters>
          </instance>
