zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00100.atdf
        <register name="WINCTRL" offset="0xC" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Window Monitor  n Control">
          <bitfield name="WEN" caption="Window n Mode Enable" mask="0x1"/>
          <bitfield name="WINTSEL" caption="Window n Interrupt Selection" mask="0x6" values="WINCTRL__WINTSEL"/>
        </register>
      </register-group>
      <register-group name="AC" caption="Analog Comparator Controller">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Control B">
          <bitfield name="START0" caption="Comparator 0 Start Comparison" mask="0x1"/>
          <bitfield name="START1" caption="Comparator 1 Start Comparison" mask="0x2"/>
        </register>
        <register name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Control C">
          <bitfield name="WIDTH" caption="Sample and Hold Clock Pulse Width" mask="0x3FF"/>
          <bitfield name="PER" caption="Sample and Hold Clock Period" mask="0x3FF000"/>
          <bitfield name="PRESCALER" caption="Prescaling Factor" mask="0x7000000" values="CTRLC__PRESCALER"/>
          <bitfield name="AIPMPEN" caption="Analog Input Charge Pump Enable" mask="0x8000000"/>
          <bitfield name="CONFIG" caption="Configuration Extension" mask="0xF0000000"/>
        </register>
        <register name="EVCTRL" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="COMPEO0" caption="Comparator 0 Event Output Enable" mask="0x1"/>
          <bitfield name="COMPEO1" caption="Comparator 1 Event Output Enable" mask="0x2"/>
          <bitfield name="WINEO0" caption="Window 0 Event Output Enable" mask="0x100"/>
          <bitfield name="COMPEI0" caption="Comparator 0 Event Input Enable" mask="0x10000"/>
          <bitfield name="COMPEI1" caption="Comparator 1 Event Input Enable" mask="0x20000"/>
          <bitfield name="INVEI0" caption="Inverted Event Input Enable 0" mask="0x1000000"/>
          <bitfield name="INVEI1" caption="Inverted Event Input Enable 1" mask="0x2000000"/>
        </register>
        <register name="INTENCLR" offset="0x10" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x100"/>
        </register>
        <register name="INTENSET" offset="0x14" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x100"/>
        </register>
        <register name="INTFLAG" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="COMP0" caption="Comparator 0" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0" mask="0x100"/>
        </register>
        <register name="STATUSA" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="Status A">
          <bitfield name="STATE0" caption="Comparator 0 Current State" mask="0x1"/>
          <bitfield name="STATE1" caption="Comparator 1 Current State" mask="0x2"/>
          <bitfield name="WSTATE0" caption="Window 0 Current State" mask="0x30000" values="STATUSA__WSTATE"/>
        </register>
        <register name="STATUSB" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Status B">
          <bitfield name="READY0" caption="Comparator 0 Ready" mask="0x1"/>
          <bitfield name="READY1" caption="Comparator 1 Ready" mask="0x2"/>
        </register>
        <register name="DBGCTRL" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x28" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="COMPCTRL0" caption="COMPCTRL 0 Synchronization Busy" mask="0x4"/>
          <bitfield name="COMPCTRL1" caption="COMPCTRL 1 Synchronization Busy" mask="0x8"/>
          <bitfield name="WINCTRL0" caption="WINCTRL 0 Synchronization Busy" mask="0x400"/>
        </register>
        <register-group name="CHANNEL" name-in-module="CHANNEL" offset="0x30" size="0x10" count="1"/>
      </register-group>
      <value-group name="COMPCTRL__INTSEL">
        <value name="TOGGLE" caption="Interrupt on comparator output toggle" value="0"/>
        <value name="RISING" caption="Interrupt on comparator output rising" value="1"/>
        <value name="FALLING" caption="Interrupt on comparator output falling" value="2"/>
        <value name="EOC" caption="Interrupt on end of comparison (single-shot mode only)" value="3"/>
      </value-group>
      <value-group name="COMPCTRL__MUXNEG">
        <value name="PIN0" caption="I/O pin 0" value="0"/>
        <value name="PIN1" caption="I/O pin 1" value="1"/>
        <value name="PIN2" caption="I/O pin 2" value="2"/>
        <value name="PIN3" caption="I/O pin 3" value="3"/>
        <value name="INT0" caption="Internal connection 0, device specific" value="4"/>
        <value name="BANDGAP" caption="Bangap" value="5"/>
        <value name="GND" caption="Ground" value="6"/>
        <value name="INTDAC" caption="Internal DAC" value="7"/>
      </value-group>
      <value-group name="COMPCTRL__MUXPOS">
        <value name="PIN0" caption="I/O pin 0" value="0"/>
        <value name="PIN1" caption="I/O pin 1" value="1"/>
        <value name="PIN2" caption="I/O pin 2" value="2"/>
        <value name="PIN3" caption="I/O pin 3" value="3"/>
        <value name="INT0" caption="Internal connection 0, device specific" value="4"/>
        <value name="INT1" caption="Internal connection 1, device specific" value="5"/>
        <value name="INT2" caption="Internal connection 2, device specific" value="6"/>
        <value name="INTDAC" caption="Internal DAC" value="7"/>
      </value-group>
