zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00100.atdf
        <register-group name="INT" name-in-module="INT" offset="0x120" size="0x10" count="1"/>
        <register name="DBGCTRL" offset="0x168" rw="RW" size="4" initval="0x00000000" caption="Debug Control Register">
          <bitfield name="DBGRUN" caption="Debug Running State" mask="0x1"/>
        </register>
      </register-group>
      <value-group name="CORCTRL__SELRES">
        <value name="6_BITS" caption="6 bits" value="0"/>
        <value name="8_BITS" caption="8 bits" value="1"/>
        <value name="10_BITS" caption="10 bits" value="2"/>
        <value name="12_BITS" caption="12 bits (power-on default)" value="3"/>
      </value-group>
      <value-group name="CORCTRL__STRGSRC">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0"/>
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="1"/>
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="2"/>
        <value name="SYNC_TRIGGER" caption="Synchronous Trigger (STRIG)" value="4"/>
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="5"/>
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="6"/>
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="7"/>
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="8"/>
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="9"/>
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="10"/>
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="11"/>
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="12"/>
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="13"/>
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="14"/>
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="15"/>
      </value-group>
      <value-group name="CHNCFG4__TRGSRC0">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0"/>
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="1"/>
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="2"/>
        <value name="SCAN_TRIGGER" caption="SCANTRG - Scan Trigger" value="3"/>
        <value name="SYNC_TRIGGER" caption="Synchronous Trigger (STRIG)" value="4"/>
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="5"/>
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="6"/>
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="7"/>
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="8"/>
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="9"/>
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="10"/>
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="11"/>
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="12"/>
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="13"/>
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="14"/>
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="15"/>
      </value-group>
      <value-group name="CHNCFG4__TRGSRC1">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0"/>
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="1"/>
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="2"/>
        <value name="SCAN_TRIGGER" caption="SCANTRG - Scan Trigger" value="3"/>
        <value name="SYNC_TRIGGER" caption="Synchronous Trigger (STRIG)" value="4"/>
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="5"/>
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="6"/>
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="7"/>
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="8"/>
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="9"/>
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="10"/>
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="11"/>
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="12"/>
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="13"/>
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="14"/>
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="15"/>
      </value-group>
      <value-group name="CHNCFG4__TRGSRC2">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0"/>
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="1"/>
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="2"/>
        <value name="SCAN_TRIGGER" caption="SCANTRG - Scan Trigger" value="3"/>
        <value name="SYNC_TRIGGER" caption="Synchronous Trigger (STRIG)" value="4"/>
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="5"/>
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="6"/>
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="7"/>
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="8"/>
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="9"/>
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="10"/>
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="11"/>
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="12"/>
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="13"/>
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="14"/>
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="15"/>
      </value-group>
      <value-group name="CHNCFG4__TRGSRC3">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0"/>
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="1"/>
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="2"/>
        <value name="SCAN_TRIGGER" caption="SCANTRG - Scan Trigger" value="3"/>
        <value name="SYNC_TRIGGER" caption="Synchronous Trigger (STRIG)" value="4"/>
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="5"/>
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="6"/>
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="7"/>
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="8"/>
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="9"/>
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="10"/>
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="11"/>
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="12"/>
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="13"/>
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="14"/>
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="15"/>
      </value-group>
