zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00100.atdf
        <register name="INTENSET" offset="0x2C" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set register">
          <bitfield name="DBG" caption="Debug Message Interrupt Enable" mask="0x1"/>
          <bitfield name="BERR" caption="Bus Error Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTFLAG" offset="0x30" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear register">
          <bitfield name="DBG" caption="Debug Message Reception" mask="0x1"/>
          <bitfield name="BERR" caption="AHB Bus Error Detection" mask="0x2"/>
        </register>
        <register name="INTFLAGSET" offset="0x34" rw="RW" size="4" atomic-op="clear:INTFLAGSET" initval="0x00000000" caption="Interrupt Flag Software Set Register">
          <bitfield name="DBG" caption="Debug Message Interrupt Flag Set" mask="0x1"/>
          <bitfield name="BERR" caption="AHB Bus Error Detection Interrupt Flag Set" mask="0x2"/>
        </register>
        <register name="SYNCBUSY" offset="0x5C" rw="R" size="4" initval="0x00000000" caption="SYNCBUSY Register">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
        </register>
        <register name="CREL_MCAN" offset="0x100" rw="R" size="4" initval="0x33000000" caption="Core Release">
          <bitfield name="DAY" caption="Timestamp day" mask="0xFF"/>
          <bitfield name="MON" caption="Timestamp month" mask="0xFF00"/>
          <bitfield name="YEAR" caption="Timestamp year" mask="0xF0000"/>
          <bitfield name="SUBSTEP" caption="Sub-step of Core Release" mask="0xF00000"/>
          <bitfield name="STEP" caption="Step of Core Release" mask="0xF000000"/>
          <bitfield name="REL" caption="Core Release" mask="0xF0000000"/>
        </register>
        <register name="ENDN" offset="0x104" rw="R" size="4" initval="0x87654321" caption="Endian">
          <bitfield name="ETV" caption="Endianness Test Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="CUST" offset="0x108" rw="RW" size="4" initval="0x00000000" caption="Customer Register">
          <bitfield name="CUST" caption="Customer Register" mask="0xFFFFFFFF"/>
        </register>
        <register name="DBTP" offset="0x10C" rw="RW" size="4" initval="0x00000A33" caption="Fast Bit Timing and Prescaler">
          <bitfield name="DSJW" caption="Data (Re)Synchronization Jump Width" mask="0xF"/>
          <bitfield name="DTSEG2" caption="Data time segment after sample point" mask="0xF0"/>
          <bitfield name="DTSEG1" caption="Data time segment before sample point" mask="0x1F00"/>
          <bitfield name="DBRP" caption="Data Baud Rate Prescaler" mask="0x1F0000"/>
          <bitfield name="TDC" caption="Tranceiver Delay Compensation" mask="0x800000"/>
        </register>
        <register name="TEST" offset="0x110" rw="RW" size="4" initval="0x00000000" caption="Test">
          <bitfield name="LBCK" caption="Loop Back Mode" mask="0x10"/>
          <bitfield name="TX" caption="Control of Transmit Pin" mask="0x60" values="TEST__TX"/>
          <bitfield name="RX" caption="Receive Pin" mask="0x80"/>
        </register>
        <register name="RWD" offset="0x114" rw="RW" size="4" initval="0x00000000" caption="RAM Watchdog">
          <bitfield name="WDC" caption="Watchdog Configuration" mask="0xFF"/>
          <bitfield name="WDV" caption="Watchdog Value" mask="0xFF00"/>
        </register>
        <register name="CCCR" offset="0x118" rw="RW" access="WSYNC" size="4" initval="0x00000001" caption="CC Control">
          <bitfield name="INIT" caption="Initialization" mask="0x1"/>
          <bitfield name="CCE" caption="Configuration Change Enable" mask="0x2"/>
          <bitfield name="ASM" caption="ASM Restricted Operation Mode" mask="0x4"/>
          <bitfield name="CSA" caption="Clock Stop Acknowledge" mask="0x8"/>
          <bitfield name="CSR" caption="Clock Stop Request" mask="0x10"/>
          <bitfield name="MON" caption="Bus Monitoring Mode" mask="0x20"/>
          <bitfield name="DAR" caption="Disable Automatic Retransmission" mask="0x40"/>
          <bitfield name="TEST" caption="Test Mode Enable" mask="0x80"/>
          <bitfield name="FDOE" caption="FD Operation Enable" mask="0x100"/>
          <bitfield name="BRSE" caption="Bit Rate Switch Enable" mask="0x200"/>
          <bitfield name="UTSU" caption="Use Timestamping Unit" mask="0x400"/>
          <bitfield name="WMM" caption="Wide Message Marker" mask="0x800"/>
          <bitfield name="PXHD" caption="Protocol Exception Handling Disable" mask="0x1000"/>
          <bitfield name="EFBI" caption="Edge Filtering during Bus Integration" mask="0x2000"/>
          <bitfield name="TXP" caption="Transmit Pause" mask="0x4000"/>
        </register>
        <register name="NBTP" offset="0x11C" rw="RW" size="4" initval="0x06000A03" caption="Nominal Bit Timing and Prescaler">
          <bitfield name="NTSEG2" caption="Nominal Time segment after sample point" mask="0x7F"/>
          <bitfield name="NTSEG1" caption="Nominal Time segment before sample point" mask="0xFF00"/>
          <bitfield name="NBRP" caption="Nominal Baud Rate Prescaler" mask="0x1FF0000"/>
          <bitfield name="NSJW" caption="Nominal (Re)Synchronization Jump Width" mask="0xFE000000"/>
        </register>
        <register name="TSCC" offset="0x120" rw="RW" size="4" initval="0x00000000" caption="Timestamp Counter Configuration">
          <bitfield name="TSS" caption="Timestamp Select" mask="0x3" values="TSCC__TSS"/>
          <bitfield name="TCP" caption="Timestamp Counter Prescaler" mask="0xF0000"/>
        </register>
        <register name="TSCV" offset="0x124" rw="R" size="4" initval="0x00000000" caption="Timestamp Counter Value">
          <bitfield name="TSC" caption="Timestamp Counter" mask="0xFFFF"/>
        </register>
        <register name="TOCC" offset="0x128" rw="RW" size="4" initval="0xFFFF0000" caption="Timeout Counter Configuration">
          <bitfield name="ETOC" caption="Enable Timeout Counter" mask="0x1"/>
          <bitfield name="TOS" caption="Timeout Select" mask="0x6" values="TOCC__TOS"/>
          <bitfield name="TOP" caption="Timeout Period" mask="0xFFFF0000"/>
        </register>
        <register name="TOCV" offset="0x12C" rw="RW" size="4" initval="0x0000FFFF" caption="Timeout Counter Value">
          <bitfield name="TOC" caption="Timeout Counter" mask="0xFFFF"/>
        </register>
