zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00100.atdf
        <register name="TXBCF" offset="0x1DC" rw="R" size="4" initval="0x00000000" caption="Tx Buffer Cancellation Finished">
          <bitfield name="CF0" caption="Tx Buffer Cancellation Finished 0" mask="0x1"/>
          <bitfield name="CF1" caption="Tx Buffer Cancellation Finished 1" mask="0x2"/>
          <bitfield name="CF2" caption="Tx Buffer Cancellation Finished 2" mask="0x4"/>
          <bitfield name="CF3" caption="Tx Buffer Cancellation Finished 3" mask="0x8"/>
          <bitfield name="CF4" caption="Tx Buffer Cancellation Finished 4" mask="0x10"/>
          <bitfield name="CF5" caption="Tx Buffer Cancellation Finished 5" mask="0x20"/>
          <bitfield name="CF6" caption="Tx Buffer Cancellation Finished 6" mask="0x40"/>
          <bitfield name="CF7" caption="Tx Buffer Cancellation Finished 7" mask="0x80"/>
          <bitfield name="CF8" caption="Tx Buffer Cancellation Finished 8" mask="0x100"/>
          <bitfield name="CF9" caption="Tx Buffer Cancellation Finished 9" mask="0x200"/>
          <bitfield name="CF10" caption="Tx Buffer Cancellation Finished 10" mask="0x400"/>
          <bitfield name="CF11" caption="Tx Buffer Cancellation Finished 11" mask="0x800"/>
          <bitfield name="CF12" caption="Tx Buffer Cancellation Finished 12" mask="0x1000"/>
          <bitfield name="CF13" caption="Tx Buffer Cancellation Finished 13" mask="0x2000"/>
          <bitfield name="CF14" caption="Tx Buffer Cancellation Finished 14" mask="0x4000"/>
          <bitfield name="CF15" caption="Tx Buffer Cancellation Finished 15" mask="0x8000"/>
          <bitfield name="CF16" caption="Tx Buffer Cancellation Finished 16" mask="0x10000"/>
          <bitfield name="CF17" caption="Tx Buffer Cancellation Finished 17" mask="0x20000"/>
          <bitfield name="CF18" caption="Tx Buffer Cancellation Finished 18" mask="0x40000"/>
          <bitfield name="CF19" caption="Tx Buffer Cancellation Finished 19" mask="0x80000"/>
          <bitfield name="CF20" caption="Tx Buffer Cancellation Finished 20" mask="0x100000"/>
          <bitfield name="CF21" caption="Tx Buffer Cancellation Finished 21" mask="0x200000"/>
          <bitfield name="CF22" caption="Tx Buffer Cancellation Finished 22" mask="0x400000"/>
          <bitfield name="CF23" caption="Tx Buffer Cancellation Finished 23" mask="0x800000"/>
          <bitfield name="CF24" caption="Tx Buffer Cancellation Finished 24" mask="0x1000000"/>
          <bitfield name="CF25" caption="Tx Buffer Cancellation Finished 25" mask="0x2000000"/>
          <bitfield name="CF26" caption="Tx Buffer Cancellation Finished 26" mask="0x4000000"/>
          <bitfield name="CF27" caption="Tx Buffer Cancellation Finished 27" mask="0x8000000"/>
          <bitfield name="CF28" caption="Tx Buffer Cancellation Finished 28" mask="0x10000000"/>
          <bitfield name="CF29" caption="Tx Buffer Cancellation Finished 29" mask="0x20000000"/>
          <bitfield name="CF30" caption="Tx Buffer Cancellation Finished 30" mask="0x40000000"/>
          <bitfield name="CF31" caption="Tx Buffer Cancellation Finished 31" mask="0x80000000"/>
        </register>
        <register name="TXBTIE" offset="0x1E0" rw="RW" size="4" initval="0x00000000" caption="Tx Buffer Transmission Interrupt Enable">
          <bitfield name="TIE0" caption="Transmission Interrupt Enable 0" mask="0x1"/>
          <bitfield name="TIE1" caption="Transmission Interrupt Enable 1" mask="0x2"/>
          <bitfield name="TIE2" caption="Transmission Interrupt Enable 2" mask="0x4"/>
          <bitfield name="TIE3" caption="Transmission Interrupt Enable 3" mask="0x8"/>
          <bitfield name="TIE4" caption="Transmission Interrupt Enable 4" mask="0x10"/>
          <bitfield name="TIE5" caption="Transmission Interrupt Enable 5" mask="0x20"/>
          <bitfield name="TIE6" caption="Transmission Interrupt Enable 6" mask="0x40"/>
          <bitfield name="TIE7" caption="Transmission Interrupt Enable 7" mask="0x80"/>
          <bitfield name="TIE8" caption="Transmission Interrupt Enable 8" mask="0x100"/>
          <bitfield name="TIE9" caption="Transmission Interrupt Enable 9" mask="0x200"/>
          <bitfield name="TIE10" caption="Transmission Interrupt Enable 10" mask="0x400"/>
          <bitfield name="TIE11" caption="Transmission Interrupt Enable 11" mask="0x800"/>
          <bitfield name="TIE12" caption="Transmission Interrupt Enable 12" mask="0x1000"/>
          <bitfield name="TIE13" caption="Transmission Interrupt Enable 13" mask="0x2000"/>
          <bitfield name="TIE14" caption="Transmission Interrupt Enable 14" mask="0x4000"/>
          <bitfield name="TIE15" caption="Transmission Interrupt Enable 15" mask="0x8000"/>
          <bitfield name="TIE16" caption="Transmission Interrupt Enable 16" mask="0x10000"/>
          <bitfield name="TIE17" caption="Transmission Interrupt Enable 17" mask="0x20000"/>
          <bitfield name="TIE18" caption="Transmission Interrupt Enable 18" mask="0x40000"/>
          <bitfield name="TIE19" caption="Transmission Interrupt Enable 19" mask="0x80000"/>
          <bitfield name="TIE20" caption="Transmission Interrupt Enable 20" mask="0x100000"/>
          <bitfield name="TIE21" caption="Transmission Interrupt Enable 21" mask="0x200000"/>
          <bitfield name="TIE22" caption="Transmission Interrupt Enable 22" mask="0x400000"/>
          <bitfield name="TIE23" caption="Transmission Interrupt Enable 23" mask="0x800000"/>
          <bitfield name="TIE24" caption="Transmission Interrupt Enable 24" mask="0x1000000"/>
          <bitfield name="TIE25" caption="Transmission Interrupt Enable 25" mask="0x2000000"/>
          <bitfield name="TIE26" caption="Transmission Interrupt Enable 26" mask="0x4000000"/>
          <bitfield name="TIE27" caption="Transmission Interrupt Enable 27" mask="0x8000000"/>
          <bitfield name="TIE28" caption="Transmission Interrupt Enable 28" mask="0x10000000"/>
          <bitfield name="TIE29" caption="Transmission Interrupt Enable 29" mask="0x20000000"/>
          <bitfield name="TIE30" caption="Transmission Interrupt Enable 30" mask="0x40000000"/>
          <bitfield name="TIE31" caption="Transmission Interrupt Enable 31" mask="0x80000000"/>
        </register>
        <register name="TXBCIE" offset="0x1E4" rw="RW" size="4" initval="0x00000000" caption="Tx Buffer Cancellation Finished Interrupt Enable">
          <bitfield name="CFIE0" caption="Cancellation Finished Interrupt Enable 0" mask="0x1"/>
          <bitfield name="CFIE1" caption="Cancellation Finished Interrupt Enable 1" mask="0x2"/>
          <bitfield name="CFIE2" caption="Cancellation Finished Interrupt Enable 2" mask="0x4"/>
          <bitfield name="CFIE3" caption="Cancellation Finished Interrupt Enable 3" mask="0x8"/>
          <bitfield name="CFIE4" caption="Cancellation Finished Interrupt Enable 4" mask="0x10"/>
          <bitfield name="CFIE5" caption="Cancellation Finished Interrupt Enable 5" mask="0x20"/>
          <bitfield name="CFIE6" caption="Cancellation Finished Interrupt Enable 6" mask="0x40"/>
          <bitfield name="CFIE7" caption="Cancellation Finished Interrupt Enable 7" mask="0x80"/>
          <bitfield name="CFIE8" caption="Cancellation Finished Interrupt Enable 8" mask="0x100"/>
          <bitfield name="CFIE9" caption="Cancellation Finished Interrupt Enable 9" mask="0x200"/>
          <bitfield name="CFIE10" caption="Cancellation Finished Interrupt Enable 10" mask="0x400"/>
          <bitfield name="CFIE11" caption="Cancellation Finished Interrupt Enable 11" mask="0x800"/>
          <bitfield name="CFIE12" caption="Cancellation Finished Interrupt Enable 12" mask="0x1000"/>
          <bitfield name="CFIE13" caption="Cancellation Finished Interrupt Enable 13" mask="0x2000"/>
          <bitfield name="CFIE14" caption="Cancellation Finished Interrupt Enable 14" mask="0x4000"/>
          <bitfield name="CFIE15" caption="Cancellation Finished Interrupt Enable 15" mask="0x8000"/>
          <bitfield name="CFIE16" caption="Cancellation Finished Interrupt Enable 16" mask="0x10000"/>
          <bitfield name="CFIE17" caption="Cancellation Finished Interrupt Enable 17" mask="0x20000"/>
          <bitfield name="CFIE18" caption="Cancellation Finished Interrupt Enable 18" mask="0x40000"/>
          <bitfield name="CFIE19" caption="Cancellation Finished Interrupt Enable 19" mask="0x80000"/>
          <bitfield name="CFIE20" caption="Cancellation Finished Interrupt Enable 20" mask="0x100000"/>
          <bitfield name="CFIE21" caption="Cancellation Finished Interrupt Enable 21" mask="0x200000"/>
          <bitfield name="CFIE22" caption="Cancellation Finished Interrupt Enable 22" mask="0x400000"/>
          <bitfield name="CFIE23" caption="Cancellation Finished Interrupt Enable 23" mask="0x800000"/>
          <bitfield name="CFIE24" caption="Cancellation Finished Interrupt Enable 24" mask="0x1000000"/>
          <bitfield name="CFIE25" caption="Cancellation Finished Interrupt Enable 25" mask="0x2000000"/>
          <bitfield name="CFIE26" caption="Cancellation Finished Interrupt Enable 26" mask="0x4000000"/>
          <bitfield name="CFIE27" caption="Cancellation Finished Interrupt Enable 27" mask="0x8000000"/>
          <bitfield name="CFIE28" caption="Cancellation Finished Interrupt Enable 28" mask="0x10000000"/>
          <bitfield name="CFIE29" caption="Cancellation Finished Interrupt Enable 29" mask="0x20000000"/>
          <bitfield name="CFIE30" caption="Cancellation Finished Interrupt Enable 30" mask="0x40000000"/>
          <bitfield name="CFIE31" caption="Cancellation Finished Interrupt Enable 31" mask="0x80000000"/>
        </register>
        <register name="TXEFC" offset="0x1F0" rw="RW" size="4" initval="0x00000000" caption="Tx Event FIFO Configuration">
          <bitfield name="EFSA" caption="Event FIFO Start Address" mask="0xFFFC"/>
          <bitfield name="EFS" caption="Event FIFO Size" mask="0x3F0000"/>
          <bitfield name="EFWM" caption="Event FIFO Watermark" mask="0x3F000000"/>
        </register>
        <register name="TXEFS" offset="0x1F4" rw="R" size="4" initval="0x00000000" caption="Tx Event FIFO Status">
          <bitfield name="EFFL" caption="Event FIFO Fill Level" mask="0x3F"/>
          <bitfield name="EFGI" caption="Event FIFO Get Index" mask="0x1F00"/>
          <bitfield name="EFPI" caption="Event FIFO Put Index" mask="0x1F0000"/>
          <bitfield name="EFF" caption="Event FIFO Full" mask="0x1000000"/>
          <bitfield name="TEFL" caption="Tx Event FIFO Element Lost" mask="0x2000000"/>
        </register>
        <register name="TXEFA" offset="0x1F8" rw="RW" size="4" initval="0x00000000" caption="Tx Event FIFO Acknowledge">
          <bitfield name="EFAI" caption="Event FIFO Acknowledge Index" mask="0x1F"/>
        </register>
        <register name="CREL_TSU" offset="0x260" rw="R" size="4" initval="0x10000000" caption="TSU CREL">
          <bitfield name="DAY" caption="Timestamp Day" mask="0xFF"/>
          <bitfield name="MON" caption="Timestamp Month" mask="0xFF00"/>
          <bitfield name="YEAR" caption="Timestamp Year" mask="0xF0000"/>
          <bitfield name="SUBSTEP" caption="Sub-step of Core Release" mask="0xF00000"/>
          <bitfield name="STEP" caption="Step of Core Release" mask="0xF000000"/>
          <bitfield name="REL" caption="Core Release" mask="0xF0000000"/>
        </register>
        <register name="TSCFG" offset="0x264" rw="RW" size="4" initval="0x00000000" caption="Timestamp Configuration">
          <bitfield name="TSUE" caption="Timestamp Unit Enable" mask="0x1"/>
          <bitfield name="TBCS" caption="Timebase Counter Select" mask="0x2"/>
          <bitfield name="SCP" caption="Select Capturing Position" mask="0x4"/>
          <bitfield name="TBPRE" caption="Time Base Prescaler" mask="0xFF00"/>
        </register>
        <register name="TSS1" offset="0x268" rw="R" size="4" initval="0x00000000" caption="Timestamp Status 1">
          <bitfield name="TSL" caption="Timestamp Lost" mask="0xFFFF"/>
          <bitfield name="TSN" caption="Timestamp New" mask="0xFFFF0000"/>
        </register>
