zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00100.atdf
      <value-group name="DAL__CPU0">
        <value name="SECURED" caption="Debugger targeting CPU0 domain can only access the DSU external address space otherwise debugger access is disabled" value="0"/>
        <value name="NS_DEBUG" caption="Debugger can access only non-secure regions" value="1"/>
        <value name="FULL_DEBUG" caption="Debugger can access secure and non-secure regions" value="2"/>
      </value-group>
      <value-group name="DAL__CPU">
        <value name="SECURED" caption="Debugger access is disabled" value="0"/>
        <value name="NS_DEBUG" caption="Debugger can access only non-secure regions" value="1"/>
        <value name="FULL_DEBUG" caption="Debugger has full access to debug CPUn" value="2"/>
        <value name="UNIMPLEMENTED" caption="Unimplemented CPU" value="3"/>
      </value-group>
      <value-group name="ENTRY0__EPRES">
        <value name="0" caption="Entry not present" value="0"/>
        <value name="1" caption="Entry present" value="1"/>
      </value-group>
      <value-group name="ENTRY0__FMT">
        <value name="0" caption="8-bit format" value="0"/>
        <value name="1" caption="32-bit format" value="1"/>
      </value-group>
      <value-group name="ENTRY1__EPRES">
        <value name="0" caption="Entry not present" value="0"/>
        <value name="1" caption="Entry present" value="1"/>
      </value-group>
      <value-group name="ENTRY1__FMT">
        <value name="0" caption="8-bit format" value="0"/>
        <value name="1" caption="32-bit format" value="1"/>
      </value-group>
      <value-group name="ENTRY2__EPRES">
        <value name="0" caption="Entry not present" value="0"/>
        <value name="1" caption="Entry present" value="1"/>
      </value-group>
      <value-group name="ENTRY2__FMT">
        <value name="0" caption="8-bit format" value="0"/>
        <value name="1" caption="32-bit format" value="1"/>
      </value-group>
      <value-group name="ENTRY3__EPRES">
        <value name="0" caption="Entry not present" value="0"/>
        <value name="1" caption="Entry present" value="1"/>
      </value-group>
      <value-group name="ENTRY3__FMT">
        <value name="0" caption="8-bit format" value="0"/>
        <value name="1" caption="32-bit format" value="1"/>
      </value-group>
      <value-group name="ENTRY4__EPRES">
        <value name="0" caption="Entry not present" value="0"/>
        <value name="1" caption="Entry present" value="1"/>
      </value-group>
      <value-group name="ENTRY4__FMT">
        <value name="0" caption="8-bit format" value="0"/>
        <value name="1" caption="32-bit format" value="1"/>
      </value-group>
      <value-group name="ENTRY5__EPRES">
        <value name="0" caption="Entry not present" value="0"/>
        <value name="1" caption="Entry present" value="1"/>
      </value-group>
      <value-group name="ENTRY5__FMT">
        <value name="0" caption="8-bit format" value="0"/>
        <value name="1" caption="32-bit format" value="1"/>
      </value-group>
      <value-group name="ENTRY6__EPRES">
        <value name="0" caption="Entry not present" value="0"/>
        <value name="1" caption="Entry present" value="1"/>
      </value-group>
      <value-group name="ENTRY6__FMT">
        <value name="0" caption="8-bit format" value="0"/>
        <value name="1" caption="32-bit format" value="1"/>
      </value-group>
      <value-group name="ENTRY7__EPRES">
        <value name="0" caption="Entry not present" value="0"/>
        <value name="1" caption="Entry present" value="1"/>
      </value-group>
      <value-group name="ENTRY7__FMT">
        <value name="0" caption="8-bit format" value="0"/>
        <value name="1" caption="32-bit format" value="1"/>
      </value-group>
      <value-group name="MEMTYPE__SYSMEM">
        <value name="0" caption="System memory not present on bus. This is a dedicated debug bus." value="0"/>
        <value name="1" caption="System memory is also present on this bus" value="1"/>
      </value-group>
    </module>
    <module name="DWT" id="SYSTEM_IP" version="1.0.0" caption="Data Watchpoint and Trace">
      <register-group name="COMPARATOR" size="0x10">
        <register name="DWT_COMP" offset="0x0" rw="RW" size="4" access-size="4" caption="DWT Comparator Register n">
          <bitfield name="VALUE" caption="Cycle/PC/data value or data address" mask="0xFFFFFFFF"/>
        </register>
        <register name="DWT_FUNCTION" offset="0x8" rw="RW" size="4" access-size="4" caption="DWT Function Register x">
          <bitfield name="MATCH" caption="Match type" mask="0xF"/>
          <bitfield name="ACTION" caption="Action on match" mask="0x30"/>
          <bitfield name="DATAVSIZE" caption="Data value size" mask="0xC00"/>
          <bitfield name="MATCHED" caption="Comparator matched" mask="0x1000000"/>
          <bitfield name="ID" caption="Identify capability" mask="0xF8000000"/>
        </register>
      </register-group>
      <register-group name="DWT" caption="Data Watchpoint and Trace">
        <register name="DWT_CTRL" offset="0x0" rw="RW" size="4" access-size="4" initval="0x0B000000" caption="DWT Control Register">
          <bitfield name="CYCCNTENA" caption="CYCCNT enable" mask="0x1"/>
          <bitfield name="POSTPRESET" caption="POSTCNT preset" mask="0x1E"/>
          <bitfield name="POSTINIT" caption="POSTCNT initial" mask="0x1E0"/>
          <bitfield name="CYCTAP" caption="Cycle count tap" mask="0x200"/>
          <bitfield name="SYNCTAP" caption="Synchronization tap" mask="0xC00"/>
          <bitfield name="PCSAMPLENA" caption="PC sample enable" mask="0x1000"/>
          <bitfield name="EXCTRCENA" caption="Exception trace enable" mask="0x10000"/>
          <bitfield name="CPIEVTENA" caption="CPI event enable" mask="0x20000"/>
          <bitfield name="EXCEVTENA" caption="Exception event enable" mask="0x40000"/>
          <bitfield name="SLEEPEVTENA" caption="Sleep event enable" mask="0x80000"/>
          <bitfield name="LSUEVTENA" caption="LSU event enable" mask="0x100000"/>
          <bitfield name="FOLDEVTENA" caption="Fold event enable" mask="0x200000"/>
          <bitfield name="CYCEVTENA" caption="Cycle event enable" mask="0x400000"/>
          <bitfield name="CYCDISS" caption="Cycle counter disabled secure" mask="0x800000"/>
          <bitfield name="NOPRFCNT" caption="No profile counters" mask="0x1000000"/>
          <bitfield name="NOCYCCNT" caption="No cycle count" mask="0x2000000"/>
          <bitfield name="NOEXTTRIG" caption="No external triggers" mask="0x4000000"/>
          <bitfield name="NOTRCPKT" caption="No trace packets" mask="0x8000000"/>
          <bitfield name="NUMCOMP" caption="Number of comparators" mask="0xF0000000"/>
        </register>
        <register name="DWT_PCSR" offset="0x1C" rw="R" size="4" access-size="4" caption="DWT Program Counter Sample Register">
          <bitfield name="EIASAMPLE" caption="Executed instruction address sample" mask="0xFFFFFFFF"/>
        </register>
        <register-group name="COMPARATOR" name-in-module="COMPARATOR" offset="0x020" size="0x10" count="2"/>
