zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00100.atdf
        <register name="CRCPAUSE" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="CRC Pause REGISTER">
          <bitfield name="PAUSE" caption="CRC Pause" mask="0x1" values="CRCPAUSE__PAUSE"/>
        </register>
        <register name="CRCMADR" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="CRC Message Address REGISTER">
          <bitfield name="CRCMADR" caption="Message Start Address in Flash" mask="0xFFFFFFF"/>
        </register>
        <register name="CRCMLEN" offset="0x34" rw="RW" size="4" initval="0x00000000" caption="CRC Message Length REGISTER">
          <bitfield name="CRCMLEN" caption="Message Length in Bytes" mask="0xFFFFF"/>
        </register>
        <register name="CRCIV" offset="0x38" rw="RW" size="4" initval="0x00000000" caption="CRC Initial Value REGISTER">
          <bitfield name="CRCIV" caption="CRC Initial Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCACC" offset="0x3C" rw="R" size="4" initval="0x00000000" caption="CRC Accumulator REGISTER">
          <bitfield name="CRCACC" caption="CRC Accumulator Result" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCPOLY" offset="0x40" rw="RW" size="4" initval="0x00000001" caption="CRC Polynomial REGISTER">
          <bitfield name="CRCPOLY" caption="CRC Polynomial Coefficients for LFSR" mask="0xFFFFFFFF" values="CRCPOLY__CRCPOLY"/>
        </register>
        <register name="CRCFXOR" offset="0x44" rw="RW" size="4" initval="0x00000000" caption="CRC Final XOR REGISTER">
          <bitfield name="CRCFXOR" caption="CRC Final XOR" mask="0xFFFFFFFF" values="CRCFXOR__CRCFXOR"/>
        </register>
        <register name="CRCSUM" offset="0x48" rw="RW" size="4" initval="0x00000000" caption="CRC CheckSUM REGISTER">
          <bitfield name="CRCSUM" caption="CRC Checksum" mask="0xFFFFFFFF"/>
        </register>
        <register name="FFLTCTRL" offset="0x4C" rw="RW" size="4" initval="0x00000000" caption="Flash ECC Fault Control REGISTER">
          <bitfield name="FLTRST" caption="Fault Reset" mask="0x1" values="FFLTCTRL__FLTRST"/>
          <bitfield name="FLTEN" caption="ECC Fault Enable bit" mask="0x2" values="FFLTCTRL__FLTEN"/>
        </register>
        <register name="FFLTMODE" offset="0x50" rw="RW" size="4" initval="0x00000000" caption="Flash ECC Fault Mode REGISTER">
          <bitfield name="CTLFLT" caption="ECC/Parity Control Fault bits" mask="0x700" values="FFLTMODE__CTLFLT"/>
          <bitfield name="FLTMD" caption="Fault Mode Control" mask="0x7000" values="FFLTMODE__FLTMD"/>
        </register>
        <register name="FFLTPTR" offset="0x54" rw="RW" size="4" initval="0x00000000" caption="Flash ECC Fault Pointer REGISTER">
          <bitfield name="FLTPTR1" caption="Fault 1 Injection Pointer" mask="0xFF"/>
          <bitfield name="FLTPTR2" caption="Fault 2 Injection Pointer" mask="0xFF0000"/>
        </register>
        <register name="FFLTADR" offset="0x58" rw="RW" size="4" initval="0x00000000" caption="Flash ECC Fault Address REGISTER">
          <bitfield name="FLTADR" caption="Fault Injection Address" mask="0xFFFFFFF"/>
        </register>
        <register name="FFLTCAP" offset="0x5C" rw="R" size="4" initval="0x00000000" caption="Flash ECC Fault Capture Address REGISTER">
          <bitfield name="FLTADR" caption="Fault Capture Address" mask="0xFFFFFFF"/>
        </register>
        <register name="FFLTPAR" offset="0x60" rw="R" size="4" initval="0x00000000" caption="Flash ECC Fault Parity REGISTER">
          <bitfield name="SECIN" caption="The Single Error Parity bits from Flash" mask="0xFF"/>
          <bitfield name="DEDIN" caption="The Overall Parity from Flash" mask="0x8000"/>
          <bitfield name="SECOUT" caption="The Calculated Single Error Parity bits" mask="0xFF0000"/>
          <bitfield name="DEDOUT" caption="The Calculated Overall Parity used in Double Error Detection" mask="0x80000000"/>
        </register>
        <register name="FFLTSYN" offset="0x64" rw="R" size="4" initval="0x00000000" caption="Flash ECC Fault Syndrome REGISTER">
          <bitfield name="SECSYN" caption="Single Error Correction Syndrome" mask="0xFF"/>
          <bitfield name="DEDSYN" caption="DED Syndrome" mask="0x8000" values="FFLTSYN__DEDSYN"/>
          <bitfield name="DSERR" caption="Double Error Detected &amp; Single Error Corrected" mask="0x30000" values="FFLTSYN__DSERR"/>
          <bitfield name="CERR" caption="ECC Control bit Error" mask="0x40000" values="FFLTSYN__CERR"/>
          <bitfield name="CTLSTAT" caption="Parity vs ECC Control Status" mask="0x7000000" values="FFLTSYN__CTLSTAT"/>
          <bitfield name="PERR" caption="Per Word (n=3:0) Parity Error Status" mask="0xF0000000" values="FFLTSYN__PERR"/>
        </register>
        <register name="CRP" offset="0x68" rw="RW" size="4" initval="0x00C20000" caption="CFM Page Read Protection REGISTER (CFM8)">
          <bitfield name="BC1ARP" caption="Panel 1 Read Protect BootCfg1A" mask="0x1" values="CRP__BC1ARP"/>
          <bitfield name="UO1RP" caption="Panel 1 Read Protect UserOTP1" mask="0x2" values="CRP__UO1RP"/>
          <bitfield name="BC1RP" caption="Panel 1 Read Protect BootCfg1" mask="0x4" values="CRP__BC1RP"/>
          <bitfield name="RCRP" caption="Panel 1 Read Protect ROMCfg" mask="0x8" values="CRP__RCRP"/>
          <bitfield name="VSSRP0" caption="Panel 1 Read Protect VSSn" mask="0x10" values="CRP__VSSRP"/>
          <bitfield name="VSSRP1" caption="Panel 1 Read Protect VSSn" mask="0x20" values="CRP__VSSRP"/>
          <bitfield name="TRP" caption="Panel 1 Read Protect Test" mask="0x40" values="CRP__TRP"/>
          <bitfield name="CORP" caption="Panel 1 Read Protect CalOTP" mask="0x80" values="CRP__CORP"/>
          <bitfield name="BC1ARPLOCK" caption="Panel 1 Lock Read Protection BootCfg1A" mask="0x10000" values="CRP__BC1ARPLOCK"/>
          <bitfield name="UO1RPLOCK" caption="Panel 1 Lock Read Protection UserOTP1" mask="0x20000" values="CRP__UO1RPLOCK"/>
          <bitfield name="BC1RPLOCK" caption="Panel 1 Lock Read Protection BootCfg1" mask="0x40000" values="CRP__BC1RPLOCK"/>
          <bitfield name="RCRPLOCK" caption="Panel 1 Lock Read Protection ROMCfg" mask="0x80000" values="CRP__RCRPLOCK"/>
          <bitfield name="VSSRPLOCK0" caption="Panel 1 Lock Read Protection VSSn" mask="0x100000" values="CRP__VSSRPLOCK"/>
          <bitfield name="VSSRPLOCK1" caption="Panel 1 Lock Read Protection VSSn" mask="0x200000" values="CRP__VSSRPLOCK"/>
          <bitfield name="TRPLOCK" caption="Panel 1 Lock Read Protection Test" mask="0x400000" values="CRP__TRPLOCK"/>
          <bitfield name="CORPLOCK" caption="Panel 1 Lock Read Protection CalOTP" mask="0x800000" values="CRP__CORPLOCK"/>
        </register>
      </register-group>
      <value-group name="CTRLA__PRIV">
        <value name="DISABLE" caption="Macro register accessible in privileged and unprivileged accesses." value="0"/>
        <value name="ENABLE" caption="Macro registers only accessible in privileged accesses" value="1"/>
      </value-group>
