zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00100.atdf
      <value-group name="INTFLAGSET__DONE">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Set Interrupt Pending" value="1"/>
      </value-group>
      <value-group name="INTFLAGSET__KEYERR">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Set Interrupt Pending" value="1"/>
      </value-group>
      <value-group name="INTFLAGSET__CFGERR">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Set Interrupt Pending" value="1"/>
      </value-group>
      <value-group name="INTFLAGSET__FIFOERR">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Set Interrupt Pending" value="1"/>
      </value-group>
      <value-group name="INTFLAGSET__BUSERR">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Set Interrupt Pending" value="1"/>
      </value-group>
      <value-group name="INTFLAGSET__WPERR">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Set Interrupt Pending" value="1"/>
      </value-group>
      <value-group name="INTFLAGSET__OPERR">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Set Interrupt Pending" value="1"/>
      </value-group>
      <value-group name="INTFLAGSET__HTDPGM">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Set Interrupt Pending" value="1"/>
      </value-group>
      <value-group name="INTFLAGSET__RSTERR">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Set Interrupt Pending" value="1"/>
      </value-group>
      <value-group name="INTFLAGSET__WRERR">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Set Interrupt Pending" value="1"/>
      </value-group>
      <value-group name="STATUS__BUSY">
        <value name="IDLE" caption="NVM Not Busy" value="0"/>
        <value name="BUSY" caption="NVM Busy - All SFR bits are not writable" value="1"/>
      </value-group>
      <value-group name="STATUS__HTDRDY">
        <value name="NOTREADY" caption="HTD Not Ready" value="0"/>
        <value name="READY" caption="HTD Ready" value="1"/>
      </value-group>
      <value-group name="KEY__FEATURE">
        <value name="LOCKALL" caption="No selection, invalid selection, or invalid Key - Locks all SFR protected by KEY register" value="0"/>
        <value name="WRKEY" caption="WRKEY Value: Unlock SFR bits associated with Write/Erase" value="1"/>
        <value name="SWAPKEY" caption="SWAPKEY Value: Unlock SFR bits associated with Panel Swapping" value="2"/>
        <value name="CFGKEY" caption="CFGKEY Value: Unlock SFR bits associated with general Flash configuration" value="4"/>
      </value-group>
      <value-group name="SWAP__BFSWAP">
        <value name="UNSWAP" caption="Upper and Lower BFM Regions are NOT Swapped" value="0"/>
        <value name="SWAP" caption="Upper and Lower BFM Regions are Swapped" value="1"/>
      </value-group>
      <value-group name="SWAP__BFSLOCK">
        <value name="UNLOCKED" caption="BFSLOCK and BFSWAP can be written" value="0"/>
        <value name="LOCKED" caption="BFSLOCK and BFSWAP cannot be written" value="1"/>
      </value-group>
      <value-group name="SWAP__PFSWAP">
        <value name="UNSWAP" caption="Upper and Lower PFM Regions are NOT Swapped" value="0"/>
        <value name="SWAP" caption="Upper and Lower PFM Regions are Swapped" value="1"/>
      </value-group>
      <value-group name="SWAP__PFSLOCK">
        <value name="UNLOCKED" caption="PFSLOCK and PFSWAP can be written" value="0"/>
        <value name="LOCKED" caption="PFSLOCK and PFSWAP cannot be written" value="1"/>
      </value-group>
      <value-group name="PWP__PWPMIR">
        <value name="UNMIRROR" caption="PWP settings are NOT Mirrored" value="0"/>
        <value name="MIRROR" caption="PWP settings are Mirrored" value="1"/>
      </value-group>
      <value-group name="PWP__PWPLOCK">
        <value name="UNLOCKED" caption="This register is Not Locked and can be modified" value="0"/>
        <value name="LOCKED" caption="This register is Locked and cannot be modified" value="1"/>
      </value-group>
      <value-group name="PWP__PWPEN">
        <value name="DISABLE" caption="PWP is Not Enabled for the defined region" value="0"/>
        <value name="ENABLE" caption="PWP is Enabled for the defined region" value="1"/>
      </value-group>
      <value-group name="LBWP__LBWP">
        <value name="DISABLE" caption="Erase and Write Protection for this Lower Boot Page is Disabled" value="0"/>
        <value name="ENABLE" caption="Erase and Write Protection for this Lower Boot Page is Enabled" value="1"/>
      </value-group>
      <value-group name="LBWP__LBWPLOCK">
        <value name="UNLOCKED" caption="This register is NOT Locked and can be modified" value="0"/>
        <value name="LOCKED" caption="This register is Locked and cannot be modified" value="1"/>
      </value-group>
      <value-group name="UBWP__UBWP">
        <value name="DISABLE" caption="Erase and Write Protection for this Upper Boot Page is Disabled" value="0"/>
        <value name="ENABLE" caption="Erase and Write Protection for this Upper Boot Page is Enabled" value="1"/>
      </value-group>
      <value-group name="UBWP__UBWPLOCK">
        <value name="UNLOCKED" caption="This register is NOT Locked and can be modified" value="0"/>
        <value name="LOCKED" caption="This register is Locked and cannot be modified" value="1"/>
      </value-group>
      <value-group name="UOWP__UO1WPR">
        <value name="DISABLE" caption="Write Protection for User OTP Page 1 Row &quot;n&quot; is Disabled" value="0"/>
        <value name="ENABLE" caption="Write Protection for User OTP Page 1 Row &quot;n&quot; is Enabled" value="1"/>
      </value-group>
      <value-group name="UOWP__UO1WPRLOCK">
        <value name="UNLOCKED" caption="UO1WPR[n] &amp;amp; UO1WPRLOCK[n] bits are NOT Locked and can be modified" value="0"/>
        <value name="LOCKED" caption="UO1WPR[n] &amp;amp; UO1WPRLOCK[n] bits are Locked and cannot be modified" value="1"/>
      </value-group>
      <value-group name="CWP__BC1AWP">
        <value name="DISABLE" caption="Erase and Write Protection for this Page is Disabled" value="0"/>
        <value name="ENABLE" caption="Erase and Write Protection for this Page is Enabled" value="1"/>
      </value-group>
      <value-group name="CWP__BC1WP">
        <value name="DISABLE" caption="Erase and Write Protection for this Page is Disabled" value="0"/>
        <value name="ENABLE" caption="Erase and Write Protection for this Page is Enabled" value="1"/>
      </value-group>
      <value-group name="CWP__RCWP">
        <value name="DISABLE" caption="Erase and Write Protection for this Page is Disabled" value="0"/>
        <value name="ENABLE" caption="Erase and Write Protection for this Page is Enabled" value="1"/>
      </value-group>
      <value-group name="CWP__VSSWP">
        <value name="DISABLE" caption="Erase and Write Protection for this Page is Disabled" value="0"/>
        <value name="ENABLE" caption="Erase and Write Protection for this Page is Enabled" value="1"/>
      </value-group>
