zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00100.atdf
        <register name="FCCFG61" offset="0x174" rw="R" size="4" caption="Calibration Configuration 61 Register">
          <bitfield name="PUFRAMUPTIME" caption="PUF RAM Power Up Delay Time" mask="0xFFFFFFFF"/>
        </register>
        <register name="FCCFG64" offset="0x180" rw="R" size="4" caption="Calibration Configuration 64 Register">
          <bitfield name="PTC_CALIB_PTC_IBIAS_TRIM" caption="PTC IBIAS TRIM" mask="0x7"/>
          <bitfield name="PTC_CALIB_PTAT_EN" caption="Enable PTAT current" mask="0x8"/>
          <bitfield name="PTC_CALIB_EXT_IBIAS_EN" caption="Enable External Bias" mask="0x10"/>
        </register>
        <register name="FCCFG65" offset="0x184" rw="R" size="4" caption="Calibration Configuration 65 Register">
          <bitfield name="EN_CMBF" caption="Enable Common Mode Power Cycling" mask="0x1"/>
          <bitfield name="EN_DITHER" caption="Enable Dithering" mask="0x4"/>
          <bitfield name="DIS_FAZ" caption="First Auto Zeroing" mask="0x8"/>
          <bitfield name="DIS_SAZ" caption="Second Auto Zeroing" mask="0x10"/>
          <bitfield name="DIS_LAZ" caption="Current Auto Zeroing" mask="0x20"/>
          <bitfield name="EN_RDAC" caption="RDAC Duty Cycle" mask="0x40"/>
          <bitfield name="DBG_SEL" caption="Enable Test Output" mask="0x80"/>
          <bitfield name="SEL_DEL" caption="Select Value to comp_out" mask="0x100"/>
          <bitfield name="T1_DELAY" caption="Programmable delay, selects the delay between regen and latch" mask="0x600"/>
          <bitfield name="TCLK_DIV" caption="Programmable divider for adc_clk_div. The division ratio is 256, 128, 64,32, and 16 going from MSB to LSB." mask="0xF800"/>
          <bitfield name="IADC_1" caption="Controls the current consumption for of the whole ADC" mask="0x300000"/>
          <bitfield name="IADC_2" caption="Controls the current consumption for of the whole ADC." mask="0xC00000"/>
          <bitfield name="ICMP_1" caption="Controls the bias current for 1 stage of the comparator. This will control the resolution needed by comparator. More current means less time but at expense of gain." mask="0x3000000"/>
          <bitfield name="ICMP_2" caption="Controls the bias current for 2 stage of the comparator. This will control the resolution needed by comparator. More current means less time but at expense of gain." mask="0xC000000"/>
          <bitfield name="ICMBF" caption="Controls the bias current for Common mode buffer amplifier (CMBF)" mask="0x30000000"/>
          <bitfield name="EN_ATEST" caption="Enable analog test signals" mask="0x40000000"/>
          <bitfield name="EN_EXT_BIAS" caption="Internal switched capacitor bias current allows to make the bias current proportional to conversion frequency." mask="0x80000000"/>
        </register>
        <register name="FCCFG66" offset="0x188" rw="R" size="4" caption="Calibration Configuration 66 Register">
          <bitfield name="AC_CONFIG" caption="Comparator 0 Calibration Configuration bits.'" mask="0xF"/>
        </register>
        <register name="FCCFG68" offset="0x190" rw="R" size="4" caption="Calibration Configuration 68 Register">
          <bitfield name="TRANSP" caption="USB PAD P Driver Configuration bits.'" mask="0x1F"/>
          <bitfield name="TRANSN" caption="USB PAD N Driver Configuration bits.'" mask="0x7C0"/>
          <bitfield name="TRIM" caption="USB PAD Rise/Fall Configuration bits.'" mask="0x7000"/>
        </register>
      </register-group>
      <value-group name="FRCFGMBIST__MOBH">
        <value name="ENABLED_ANY" caption="MOB runs after any non-BACKUP/HIBERNATE exit reset" value="1"/>
        <value name="ENABLED_POR" caption="MOB runs only after a POR" value="2"/>
        <value name="DISABLED" caption="MOB Disabled" value="3"/>
</value-group>
        <value-group name="BOOT_FLAG__PUFSCORE">
            <value name="0" caption="0" value="0"/>
            <value name="1" caption="1" value="1"/>
            <value name="2" caption="2" value="2"/>
            <value name="3" caption="3" value="3"/>
            <value name="4" caption="4" value="4"/>
            <value name="5" caption="5" value="5"/>
            <value name="6" caption="6" value="6"/>
            <value name="7" caption="7" value="7"/>
        </value-group>
        <value-group name="PAC_WRCTRL_H2PB0__KEY">
            <value name="OFF" caption="OFF - No Action" value="0"/>
            <value name="CLEAR" caption="CLEAR - Clear the peripheral write protection" value="1"/>
            <value name="SET" caption="SET - Set the peripheral write protection" value="2"/>
            <value name="LOCK" caption="LOCK - Set and Lock the write protection state of the peripheral until the next reset" value="3"/>
        </value-group>
        <value-group name="PAC_WRCTRL_H2PB1__KEY">
            <value name="OFF" caption="OFF - No Action" value="0"/>
            <value name="CLEAR" caption="CLEAR - Clear the peripheral write protection" value="1"/>
            <value name="SET" caption="SET - Set the peripheral write protection" value="2"/>
            <value name="LOCK" caption="LOCK - Set and Lock the write protection state of the peripheral until the next reset" value="3"/>
        </value-group>
        <value-group name="PAC_WRCTRL_H2PB2__KEY">
            <value name="OFF" caption="OFF - No Action" value="0"/>
            <value name="CLEAR" caption="CLEAR - Clear the peripheral write protection" value="1"/>
            <value name="SET" caption="SET - Set the peripheral write protection" value="2"/>
            <value name="LOCK" caption="LOCK - Set and Lock the write protection state of the peripheral until the next reset" value="3"/>
        </value-group>
        <value-group name="IDAU_RCTRL_BFM_BLOCK__CMD">
            <value name="CLRNONSEC" caption="Clear IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=0)" value="0x5A"/>
            <value name="SETNONSEC" caption="Set IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=1)" value="0x5B"/>
        </value-group>
        <value-group name="IDAU_RCTRL_BFM_WATERMARK__CMD">
            <value name="WRSZ" caption="Write IDAU region x Size (RSTATUSB[x].SIZE=ARG)" value="0x5C"/>
        </value-group>
        <value-group name="IDAU_RCTRL_PFMANS_BLOCK__CMD">
            <value name="CLRNONSEC" caption="Clear IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=0)" value="0x5A"/>
            <value name="SETNONSEC" caption="Set IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=1)" value="0x5B"/>
        </value-group>
        <value-group name="IDAU_RCTRL_PFMANS_WATERMARK__CMD">
            <value name="WRSZ" caption="Write IDAU region x Size (RSTATUSB[x].SIZE=ARG)" value="0x5C"/>
        </value-group>
        <value-group name="IDAU_RCTRL_PFMANSC_BLOCK__CMD">
            <value name="CLRNONSEC" caption="Clear IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=0)" value="0x5A"/>
            <value name="SETNONSEC" caption="Set IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=1)" value="0x5B"/>
        </value-group>
