zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00100.atdf
        <register name="WRCONFIG" offset="0x28" rw="W" size="4" access-size="4" initval="0x00000000" caption="Write Configuration">
          <bitfield name="PINMASK" caption="Pin Mask for Multiple Pin Configuration" mask="0xFFFF"/>
          <bitfield name="PMUXEN" caption="Peripheral Multiplexer Enable" mask="0x10000"/>
          <bitfield name="INEN" caption="Input Enable" mask="0x20000"/>
          <bitfield name="PULLEN" caption="Pull Enable" mask="0x40000"/>
          <bitfield name="ODRAIN" caption="Open Drain Output" mask="0x80000"/>
          <bitfield name="SLEWLIM" caption="Output Driver Slew Rate Selection" mask="0x300000"/>
          <bitfield name="PMUX" caption="Peripheral Multiplexing" mask="0xF000000"/>
          <bitfield name="WRPMUX" caption="Write PMUX" mask="0x10000000"/>
          <bitfield name="WRPINCFG" caption="Write PINCFG" mask="0x40000000"/>
          <bitfield name="HWSEL" caption="Half-Word Select" mask="0x80000000"/>
        </register>
        <register name="EVCTRL" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="Event Input Control">
          <bitfield name="PID0" caption="PORT Event Pin Identifier 0" mask="0x1F"/>
          <bitfield name="EVACT0" caption="PORT Event Action 0" mask="0x60" values="EVCTRL__EVACT0"/>
          <bitfield name="PORTEI0" caption="PORT Event Input Enable 0" mask="0x80"/>
          <bitfield name="PID1" caption="PORT Event Pin Identifier 1" mask="0x1F00"/>
          <bitfield name="EVACT1" caption="PORT Event Action 1" mask="0x6000"/>
          <bitfield name="PORTEI1" caption="PORT Event Input Enable 1" mask="0x8000"/>
          <bitfield name="PID2" caption="PORT Event Pin Identifier 2" mask="0x1F0000"/>
          <bitfield name="EVACT2" caption="PORT Event Action 2" mask="0x600000"/>
          <bitfield name="PORTEI2" caption="PORT Event Input Enable 2" mask="0x800000"/>
          <bitfield name="PID3" caption="PORT Event Pin Identifier 3" mask="0x1F000000"/>
          <bitfield name="EVACT3" caption="PORT Event Action 3" mask="0x60000000"/>
          <bitfield name="PORTEI3" caption="PORT Event Input Enable 3" mask="0x80000000"/>
        </register>
        <register name="PMUX" offset="0x30" rw="RW" size="1" count="16" initval="0x00" caption="Peripheral Multiplexing">
          <bitfield name="PMUXE" caption="Peripheral Multiplexing for Even-Numbered Pin" mask="0xF" values="PMUX__PMUXE"/>
          <bitfield name="PMUXO" caption="Peripheral Multiplexing for Odd-Numbered Pin" mask="0xF0" values="PMUX__PMUXO"/>
        </register>
        <register name="PINCFG" offset="0x40" rw="RW" size="1" count="32" initval="0x00" caption="Pin Configuration">
          <bitfield name="PMUXEN" caption="Peripheral Multiplexer Enable" mask="0x1"/>
          <bitfield name="INEN" caption="Input Enable" mask="0x2"/>
          <bitfield name="PULLEN" caption="Pull Enable" mask="0x4"/>
          <bitfield name="ODRAIN" caption="Open Drain Output" mask="0x8"/>
          <bitfield name="SLEWLIM" caption="Output Driver Slew Rate Selection" mask="0x30" values="PINCFG__SLEWLIM"/>
        </register>
        <register name="INTENCLR" offset="0x60" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="NSCHK" caption="Non-Secure Check Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x64" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="NSCHK" caption="Non-Secure Check Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x68" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="NSCHK" caption="Non-Secure Check" mask="0x1"/>
        </register>
        <register name="NONSEC" offset="0x6C" rw="RW" size="4" initval="0x00000000" caption="Security Attribution">
          <bitfield name="NONSEC" caption="Port Security Attribution" mask="0xFFFFFFFF"/>
        </register>
        <register name="NSCHK" offset="0x70" rw="RW" size="4" initval="0x00000000" caption="Security Attribution Check">
          <bitfield name="NSCHK" caption="Port Security Attribution Check" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <register-group name="PORT" caption="Port Module">
        <register-group name="GROUP" name-in-module="GROUP" offset="0x00" size="0x80" count="4"/>
      </register-group>
      <value-group name="EVCTRL__EVACT0">
        <value name="OUT" caption="Event output to pin" value="0x0"/>
        <value name="SET" caption="Set output register of pin on event" value="0x1"/>
        <value name="CLR" caption="Clear output register of pin on event" value="0x2"/>
        <value name="TGL" caption="Toggle output register of pin on event" value="0x3"/>
      </value-group>
      <value-group name="PMUX__PMUXE">
        <value name="A" caption="Peripheral function A selected" value="0"/>
        <value name="B" caption="Peripheral function B selected" value="1"/>
        <value name="D" caption="Peripheral function D selected" value="3"/>
        <value name="F" caption="Peripheral function F selected" value="5"/>
        <value name="H" caption="Peripheral function H selected" value="7"/>
        <value name="I" caption="Peripheral function I selected" value="8"/>
        <value name="K" caption="Peripheral function K selected" value="10"/>
        <value name="P" caption="Peripheral function P selected" value="15"/>
      </value-group>
      <value-group name="PMUX__PMUXO">
        <value name="A" caption="Peripheral function A selected" value="0"/>
        <value name="B" caption="Peripheral function B selected" value="1"/>
        <value name="D" caption="Peripheral function D selected" value="3"/>
        <value name="F" caption="Peripheral function F selected" value="5"/>
        <value name="H" caption="Peripheral function H selected" value="7"/>
        <value name="I" caption="Peripheral function I selected" value="8"/>
        <value name="K" caption="Peripheral function K selected" value="10"/>
        <value name="P" caption="Peripheral function P selected" value="15"/>
      </value-group>
      <value-group name="PINCFG__SLEWLIM">
        <value name="FAST" caption="Slew rate control disabled (fast rise/fall time operation)" value="0x0"/>
        <value name="SLOW4" caption="Slew rate control enabled (4x slower)" value="0x1"/>
        <value name="SLOW8" caption="Slew rate control enabled (8x slower)" value="0x2"/>
        <value name="SLOW12" caption="Slew rate control enabled (12x slower)" value="0x3"/>
      </value-group>
    </module>
    <module name="PTC" id="04743" name2="afe_ptc_ctrl_apb_plrs_v1" version="1a0" caption="Polaris Peripheral Touch Controller">
      <register-group name="PTC" caption="Polaris Peripheral Touch Controller">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="CONTROL ENABLE REGISTER">
          <bitfield name="SWRST" caption="Software Reset for this macro." mask="0x1" values="CTRLA__SWRST"/>
          <bitfield name="ENABLE" caption="PTC -- Enable" mask="0x2" values="CTRLA__ENABLE"/>
          <bitfield name="PRIV" caption="Privileged Access Only -- provides filtering of privilege/non-privilege bus accesses to SFR registers" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run In Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
        </register>
        <register name="EVCTRL" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="EVENT CONTROL REGISTER">
          <bitfield name="STCONVEI" caption="Start Conversion Event Input Enable" mask="0x1"/>
          <bitfield name="DSEQREI" caption="DMA Sequencing Restart Event Input Enable" mask="0x2"/>
          <bitfield name="STCONVINV" caption="Start Conversion Event Invert Enable" mask="0x4"/>
          <bitfield name="DSEQRINV" caption="DMA Sequencing Restart Event Invert Enable" mask="0x8"/>
          <bitfield name="EOCEO" caption="End of Conversion Event Output Enable" mask="0x10"/>
          <bitfield name="WCOMPEO" caption="Window Comparator Event Output Enable" mask="0x20"/>
        </register>
        <register name="DBGCTRL" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="DEBUG CONTROL Register">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
        <register name="CTRLB" offset="0xC" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="CONTROL B Register">
          <bitfield name="CTSM" caption="Capacitive Touch Sensing Mode" mask="0x7"/>
          <bitfield name="INTSEL" caption="Interrupt Selection" mask="0x10"/>
          <bitfield name="SDS" caption="Sampling Delay Selection." mask="0xF00"/>
          <bitfield name="ASDV" caption="Automatic Sampling Delay Variation." mask="0x1000"/>
          <bitfield name="CCDS" caption="Channel Change Delay Selection" mask="0x6000"/>
          <bitfield name="RSEL" caption="Resistor Selection" mask="0x700000"/>
        </register>
        <register name="CTRLC" offset="0x10" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="CONTROL C Register">
          <bitfield name="CCF" caption="Compensation Capacitor Fine Value" mask="0x1F"/>
          <bitfield name="CCC" caption="Compensation Capacitor Coarse Value" mask="0x1F00"/>
          <bitfield name="CI" caption="Integration Capacitor Value" mask="0x1F0000"/>
          <bitfield name="CSD" caption="Charge Share Delay Value" mask="0xFF000000"/>
        </register>
        <register name="CTRLD" offset="0x14" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="CONTROL D Register">
          <bitfield name="DAN" caption="Digital Accumulation Number" mask="0x7"/>
          <bitfield name="AAN" caption="Analog Accumulation Number" mask="0xF00"/>
          <bitfield name="WINCM" caption="Window Comparator Mode" mask="0x70000"/>
          <bitfield name="WINSS" caption="Window Single Sample" mask="0x80000"/>
          <bitfield name="EXTCIEN" caption="External Integration Capacitor Enable" mask="0x300000"/>
          <bitfield name="POLICC" caption="Polarity of Internal Compensation Capacitor" mask="0x800000"/>
          <bitfield name="DSEN" caption="DSEN Driven Shield Enable." mask="0x1000000"/>
          <bitfield name="DSEQSTOP" caption="Stop DMA Sequence" mask="0x80000000"/>
        </register>
        <register name="CTRLE" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="CONTROL E REGISTER">
          <bitfield name="AIPMPEN" caption="Analog Input Charge Pump Enable" mask="0x10"/>
          <bitfield name="PRSC" caption="This field defines the PTC clock relative to the peripheral clock according to the table below." mask="0x700"/>
          <bitfield name="WKUPEXP" caption="Wake-Up Exponent" mask="0xF000"/>
        </register>
        <register name="SWTRIG" offset="0x1C" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Software Trigger Register">
          <bitfield name="STCONV" caption="Start Conversion" mask="0x1"/>
        </register>
        <register name="WINLT" offset="0x20" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Window Comparator Low Threshold Register">
          <bitfield name="WCLT" caption="Window Comparator Low Threshold" mask="0xFFFF"/>
        </register>
        <register name="WINHT" offset="0x24" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Window Comparator High Threshold Register">
          <bitfield name="WCHT" caption="Window Comparator High Threshold" mask="0xFFFF"/>
        </register>
        <register name="PINEN1" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="PTC Line Enable 1 Register">
          <bitfield name="PINEN" caption="PTC-Line 31-0 Enable" mask="0xFFFFFFFF"/>
        </register>
        <register name="PINEN2" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="PTC Line Enable 2 Register">
          <bitfield name="PINEN" caption="PTC-Line 63-32 Enable" mask="0xF"/>
        </register>
        <register name="XSEL1" offset="0x30" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="X Line Selection 1 Register">
          <bitfield name="XSEL" caption="X-Line Selection [31:0]" mask="0xFFFFFFFF"/>
        </register>
        <register name="XSEL2" offset="0x34" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="X Line Selection 2 Register">
          <bitfield name="XSEL" caption="X-Line Selection [63:32]" mask="0xF"/>
        </register>
        <register name="YSEL1" offset="0x38" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Y Line Selection 1 Register">
          <bitfield name="YSEL" caption="Y-Line Selection [31:0]" mask="0xFFFFFFFF"/>
        </register>
        <register name="YSEL2" offset="0x3C" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Y Line Selection 2 Register">
          <bitfield name="YSEL" caption="Y-Line Selection [63:32]" mask="0xF"/>
        </register>
